Revit 2026 API

# StructuralSectionRoundNameKey Property

---

Name Key

**Namespace:** Autodesk.Revit.DB.Structure.StructuralSections**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public string NameKey { get; set; }
```
```vb
Public Property NameKey As String
	Get
	Set
```
```cpp
public:
property String^ NameKey {
	String^ get ();
	void set (String^ value);
}
```
```fsharp
member NameKey : string with get, set
```

#### Property Value

String

| Exception | Condition |
| --- | --- |
| ArgumentNullException | When setting this property: A non-optional argument was null |

#### Reference

StructuralSectionRound Class

Autodesk.Revit.DB.Structure.StructuralSections Namespace